In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

visa_df=pd.read_csv('Visadataset.csv')

cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

In [3]:
dict1={'Name': ['Ramesh','Suresh', 'Sathish',np.nan],
       'Age': [30,33,np.nan,36],
       'City': [np.nan,'Hyd', 'Hyd', 'Blr']}

In [4]:
data=pd.DataFrame(dict1)
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish   NaN  Hyd
3      NaN  36.0  Blr

In [5]:
data.to_csv('data1.csv',index=False)

**isnull**

In [7]:
data.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [6]:
data.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

**drop**

- drop the null values data based on rows and columns

In [8]:
# I want to extract the data without Null values
data.dropna()

     Name   Age City
1  Suresh  33.0  Hyd

In [9]:
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish   NaN  Hyd
3      NaN  36.0  Blr